{"data":{"post":{"id":"d0d2fd49-1dac-59b4-a17b-3964d9a1390c","html":"<h1>8 principios para abordar programadores no LinkedIn de forma eficaz</h1>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-0c070.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 800px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 66.66666666666666%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAgMAAAAAAAAAAAAAAAAAAAUBAwT/xAAWAQEBAQAAAAAAAAAAAAAAAAACAAH/2gAMAwEAAhADEAAAAccVMrVY1Cv/xAAbEAACAgMBAAAAAAAAAAAAAAABAgARAxITBP/aAAgBAQABBQLkCr+fWa1Mb0MJ6oyrf//EABURAQEAAAAAAAAAAAAAAAAAAAAS/9oACAEDAQE/AUv/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEv/aAAgBAgEBPwFT/8QAGRAAAgMBAAAAAAAAAAAAAAAAAAEiMUEQ/9oACAEBAAY/Ao6bxq0yWFH/xAAaEAACAwEBAAAAAAAAAAAAAAABEQAhcRAx/9oACAEBAAE/IQeYk3yFF2CbESkMSoJRBh5zH//aAAwDAQACAAMAAAAQvA//xAAYEQEBAAMAAAAAAAAAAAAAAAABABEhYf/aAAgBAwEBPxDAmo7v/8QAFxEAAwEAAAAAAAAAAAAAAAAAAAERIf/aAAgBAgEBPxCxj1iP/8QAHBABAAICAwEAAAAAAAAAAAAAAQARITFBUYFh/9oACAEBAAE/EKy0ECKDL5z5EOrUBMwCJe4fNjloF58irAqSoVr6k0pCtE//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px transparent;\"\n        alt=\"unsplash.com\"\n        title=\"\"\n        src=\"/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-78f2b.jpg\"\n        srcset=\"/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-dce19.jpg 200w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-c1413.jpg 400w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-78f2b.jpg 800w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-ab4c4.jpg 1200w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-bc99b.jpg 1600w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-34a60.jpg 2400w,\n/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-0c070.jpg 5472w\"\n        sizes=\"(max-width: 800px) 100vw, 800px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p><sup>Photo by Headway on Unsplash</sup></p>\n<p>Atualmente o mercado de tecnologia está extremamente aquecido. Até o final de 2018, existiam mais de 460 mil vagas abertas na área! E, advinha só, não temos profissionais qualificados o suficiente para preencher essas vagas. Isso significa que o trabalho de recrutamento está cada vez mais importante. Além disso, recrutamento pode consumir muitos recursos ($$) da sua empresa (voce pode ver exatamente quanto usando a planilha do <a href=\"%5BPlanilha%20Custo%20do%20Recrutamento%20e%20Sele%C3%A7%C3%A3o%20-%20Gupy%5D(https://info.gupy.io/material-planilha-custo-do-recrutamento-e-selecao)\">Grupy</a>) .</p>\n<p>Sabendo disso, otimizar a maneira como voce aborda seus candidatos pode não só aumentar sua conversão, como também diminuir significativamente os custos com recrutamento e seleção de profissionais.\nAbaixo são algumas dicas que eu coletei baseado em abordagens recebidas e realizadas no Brasil, na Europa e nos Estados Unidos.\nA intenção é que voce se destaque dos outros centenas que enviam mensagens diariamente e, quem sabe, melhorar a qualidade geral das abordagens que nós, nerds da programação, recebemos :)</p>\n<h2>Leia o perfil do candidato!</h2>\n<p>Isso parece obvio, certo?  Muita gente não faz isso!\nExemplo: Seu candidato é um desenvolvedor que trabalha com Front End, porque diabos uma vaga de Desenvolvedor Java Senior se encaixa no perfil dessa pessoa?</p>\n<p>Existem pessoas que talvez queiram mudar de tecnologia? Com certeza! Mas deixe claro que você leu o perfil na hora de mandar mensagem, algo como: <code class=\"language-text\">“Olá Fulano, vi que você trabalha com JavaScript, mas gostei muito do seu perfil. Tem interesse em uma mudança para outra tecnologia?”</code></p>\n<p>Isso se aplica também a requisitos da sua vaga, como superior completo ou algo do tipo (se você não vai contratar o cara que não tem superior completo, porque aborda-lo?)</p>\n<h2>Saiba o máximo possível sobre a sua vaga (isso inclui a parte técnica)</h2>\n<p>Lembra da parte do mercado super aquecido? Isso também significa que os desenvolvedores podem escolher a empresa que eles querem trabalhar! E, vou te falar, dinheiro é importante mas não é tudo. As vezes uma tech stack legal e um projeto desafiador pesam bastante.</p>\n<p>Estude um pouco da stack que sua empresa usa, os motivos de ser assim, porque é divertido e no que isso agrega valor para o candidato. Um conselho: Pergunte para um desenvolvedor da empresa que esta contratando! :)</p>\n<h2>Refine seu texto</h2>\n<p>Na minha opinião, o melhor texto tem que ser simples, não muito longo, mas dar todas as informações importantes para quem está lendo.</p>\n<p>Seu texto deve conter: </p>\n<ul>\n<li>Descrição breve da vaga (Desenvolvedor BackEnd para a equipe de ecommerce)</li>\n<li>Descrição breve da empresa, citando um pouco sobre o momento que ela esta hoje (ta crescendo? Qual o tamanho do time? Em que tipo de business ela atua? )</li>\n<li>Local (e se aceita trabalho remoto)</li>\n<li>Tecnologias usadas</li>\n<li>Budget para a vaga e benefícios (abrir o budget ajuda MUITO a filtrar, pode ter certeza) (Video game não é beneficio)</li>\n<li>Como é o processo seletivo? (Se for muitolongo, nenhum de nós perde tempo)</li>\n</ul>\n<h2>Seja direto (mas não muito)</h2>\n<p>Por ser direto, entenda: Não adianta ficar puxando o saco do candidato. Lembro que recebi uma mensagem falando que vi que eu estava entre os top 10% PHP Developers! (Eu não faço PHP desde a faculdade). Mas também não chegue ja pedindo telefone rs</p>\n<p>Pensa que a mensagem é meio que um “jogo de sedução”, você não conhece uma pessoa na balada e ja chega pedindo o telefone e o endereço. Veja se a pessoa tem interesse na vaga, se está na disposição de uma conversa e, caso positivo, se vocês podem conversar via telefone/skype/hangouts etc.</p>\n<h2>Teste suas abordagens</h2>\n<p>A melhor maneira de validar o que está funcionando e o que não está é testando. Mande de um jeito, veja como é a resposta. Não deu certo? Mantenha-se fazendo iterações até achar uma que se encaixe bem no perfil que voce está buscando.</p>\n<p>Existe uma expressão famosa na Engenharia de Software que é: “Não existe bala de prata.”. Ou seja, cada problema pede uma solução. Não existe uma que se encaixe em todos os cenários.</p>\n<p>“Para quem só tem um martelo, todo problema vira prego.”</p>\n<h2>Peça ajuda aos “universitários”</h2>\n<p>Você com certeza tem acesso a um time de engenharia que pode te dar feedbacks no seu texto de abordagem. Peça ajuda para eles, peça que façam uma revisão rápida, até porque você está contratando o proximo espartano que vai ficar lado-a-lado com seu time no campo de batalha (e todos querem que seu parceiro consiga levantar o escudo, certo?)</p>\n<p>Vale também pedir feedback dos próprios candidatos! Pergunte:\n<code class=\"language-text\">O que você acha que está faltando na mensagem que eu te enviei?</code></p>\n<p>Pode ter certeza que vão sair coisas construtivas na maioria das vezes (digo maioria porque tem babaca em todo lugar né rs)</p>\n<h2>Lidando com o “anti-recruiter”</h2>\n<p>Uma dura verdade mas que deve ser encarada é:\n<code class=\"language-text\">Desenvolvedores criaram uma &#39;camada anti-recruiter&#39;</code></p>\n<p>Isso se deve ao fato de que tem muita gente mandando mensagem todos os dias, muitas delas sem pé nem cabeça ou diretas demais . Beleza, mas como você faz pra quebrar essa camada? Eu acredito que a melhor maneira seja a empatia (por isso voce deve ler o perfil do seu candidato!)</p>\n<p>O candidato ja morou na praia e você também? Vocês conhecem alguém em comum?</p>\n<p>Explore esses pontos com sabedoria sem parecer estranho rsrs </p>\n<h2>Considerações finais</h2>\n<p>Mais uma vez: “Não existe bala de prata“.</p>\n<p>O que eu estou dividindo com vocês são experiencias próprias que combinei baseado no tempo que estou trabalhando com tecnologia pelo mundão e a maneira que eu (e pessoas que eu convivo e abordo) gostam de ser abordadas. </p>\n<p>E, o mais importante, mantenha um bom relacionamento com as pessoas! Mesmo que a resposta seja negativa, NERDS TEM AMIGOS NERDS! Eles podem te indicar alguém, seja agora ou num futuro proximo, ou até mesmo quando eles estiverem insatisfeitos com seu trabalho depois de algum tempo (pode ter certeza que isso acontece bastante)</p>\n<p>Espero que vocês tenham curtido e até a próxima!</p>","fields":{"slug":"/8-maneiras-abordar-linkedin-programadores-pt/","prefix":"2019-05-07"},"frontmatter":{"title":"8 principios para abordar programadores no LinkedIn de forma eficaz","author":"eduardo pedroso","category":"recrutamento","cover":{"childImageSharp":{"resize":{"src":"/static/headway-537308-unsplash-e0b1953a25bb8d6aa74d6e61eb22560f-ada8c.jpg"}}}}},"authornote":{"id":"f8330641-d6ce-5956-be02-a6e7532ebb9b","html":"<p><strong>Mr. Gatsby</strong> Proin ornare ligula eu tellus tempus elementum. Aenean <a href=\"/\">bibendum</a> iaculis mi, nec blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus. Blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/8-maneiras-abordar-linkedin-programadores-pt/","prev":{"id":"0f4c93a6-7900-5649-ace9-9ea27d8db6d9","fields":{"slug":"/you-only-live-once-en/","prefix":"2017-10-05","source":"posts"},"frontmatter":{"title":"You only live once","category":"sayings"}},"source":"posts"}}